Repository: KarimGP/P01-FindPoint
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ca, es

source: You have successfully registered! Please log in.
ca: T'has registrat amb èxit. Si us plau, inicia sessió!
es: Te has registrado con éxito. ¡Por favor, inicia sesión!

source: Username or email already exists!
ca: El nom d'usuari o el correu electrònic ja existeix!
es: ¡El nombre de usuario o correo electrónico ya existe!

source: Error loading country list: {}
ca: Error en carregar la llista de països: {}
es: Error al cargar la lista de países: {}

source: Country list file not found
ca: No s'ha trobat el fitxer de la llista de països
es: No se encontró el archivo de la lista de países

source: You were successfully logged in!
ca: Has iniciat sessió amb èxit!
es: ¡Has iniciado sesión con éxito!

source: Login failed. Check your credentials and try again.
ca: Error en iniciar sessió. Verifica les teves credencials i torna a intentar-ho.
es: Error en el inicio de sesión. Verifica tus credenciales e inténtalo de nuevo.

source: Please select a city first.
ca: Si us plau, selecciona una ciutat primer.
es: Por favor, selecciona una ciudad primero.

source: You have been logged out.
ca: Has tancat sessió.
es: Has cerrado sesión.

source: Your profile has been updated!
ca: El teu perfil s'ha actualitzat!
es: ¡Tu perfil ha sido actualizado!

source: Your account has been deleted successfully.
ca: El teu compte s'ha eliminat amb èxit.
es: Tu cuenta ha sido eliminada con éxito.

source: Please select a valid city.
ca: Si us plau, selecciona una ciutat vàlida.
es: Por favor, selecciona una ciudad válida.

source: Rate by the users: {:.2f}
ca: Puntuació pels usuaris: {:.2f}
es: Calificación por los usuarios: {:.2f}

source: {} has not been rated yet.
ca: {} encara no ha estat puntuat.
es: {} aún no ha sido calificado.

source: You should visit {}
ca: Hauries de visitar {}
es: Deberías visitar {}

source: No points available for the selected category: {}.
ca: No hi ha punts disponibles per a la categoria seleccionada: {}.
es: No hay puntos disponibles para la categoría seleccionada: {}.

source: Category '{}' does not exist in the selected city.
ca: La categoria '{}' no existeix a la ciutat seleccionada.
es: La categoría '{}' no existe en la ciudad seleccionada.

source: Thank you! The new average rating for {} in {} is {:.2f}.
ca: Gràcies! La nova puntuació mitjana per a {} a {} és {:.2f}.
es: ¡Gracias! La nueva calificación promedio para {} en {} es {:.2f}.

source: Rating must be between 1 and 5.
ca: La puntuació ha d'estar entre 1 i 5.
es: La calificación debe estar entre 1 y 5.

source: Please enter a valid number for rating.
ca: Si us plau, introdueix un número vàlid per puntuar.
es: Por favor, introduce un número válido para calificar.

source: The place "{}" does not exist in {} under the category "{}".
ca: El lloc "{}" no existeix a {} sota la categoria "{}".
es: El lugar "{}" no existe en {} bajo la categoría "{}".

source: The point "{}" already exists in {}.
ca: El punt "{}" ja existeix a {}.
es: El punto "{}" ya existe en {}.

source: Place added successfully in {}!
ca: Lloc afegit amb èxit a {}!
es: ¡Lugar añadido con éxito en {}!

source: {} added successfully in {}!
ca: {} afegit amb èxit a {}!
es: ¡{} añadido con éxito en {}!

source: The point "{}" was successfully deleted from {}.
ca: El punt "{}" ha estat eliminat amb èxit de {}.
es: El punto "{}" ha sido eliminado con éxito de {}.

source: You do not have permission to delete the point "{}".
ca: No tens permís per eliminar el punt "{}".
es: No tienes permiso para eliminar el punto "{}".

source: Add a New Point
ca: Afegeix un Nou Punt
es: Añadir un Nuevo Lugar

source: Name the new point:
ca: Nom del nou punt:
es: Nombre del nuevo lugar:

source: Category:
ca: Categoria:
es: Categoría:

source: Latitude:
ca: Latitud:
es: Latitud:

source: Longitude:
ca: Longitud:
es: Longitud:

source: Add Point
ca: Afegeix Punt
es: Añadir Lugar

source: Choose a Category
ca: Tria una Categoria
es: Elige una Categoría

source: Please, choose between Architecture, Art or Urban spaces:
ca: Si us plau, tria entre Arquitectura, Art o Espais Urbans:
es: Por favor, elige entre Arquitectura, Arte o Espacios Urbanos:

source: Architecture
ca: Arquitectura
es: Arquitectura

source: Art
es: Arte

source: Urban Spaces
ca: Espais Urbans
es: Espacios Urbanos

source: Welcome to
ca: Benvingut a
es: Bienvenido a

source: Find a point
ca: Troba un punt
es: Encuentra un lugar

source: Rate a Point
ca: Valora un Punt
es: Valora un Lugar

source: Add a Point
ca: Afegeix un Punt
es: Añadir un Lugar

source: Delete a Point
ca: Elimina un Punt
es: Eliminar un Lugar

source: Are you sure you want to delete your account? This action cannot be undone.
ca: Estàs segur que vols eliminar el teu compte? Aquesta acció no es pot desfer.
es: ¿Estás seguro de que deseas eliminar tu cuenta? Esta acción no se puede deshacer.

source: Delete my Account
ca: Elimina el meu Compte
es: Eliminar mi Cuenta

source: Point to Delete:
ca: Punt a Eliminar:
es: Lugar a Eliminar:

source: Delete Point
ca: Elimina Punt
es: Eliminar Lugar

source: Username
ca: Nom d'Usuari
es: Nombre de Usuario

source: Birth Year
ca: Any de Naixement
es: Año de Nacimiento

source: Country
ca: País
es: País

source: Email
ca: Correu Electrònic
es: Correo Electrónico

source: New Password
ca: Nova Contrasenya
es: Nueva Contraseña

source: Leave blank to keep your current password.
ca: Deixa en blanc per mantenir la teva contrasenya actual.
es: Deja en blanco para mantener tu contraseña actual.

source: Save Changes
ca: Desa els Canvis
es: Guardar Cambios

source: Place Name
ca: Nom del Lloc
es: Nombre del Lugar

source: Rating (1-5):
ca: Puntuació (1-5):
es: Calificación (1-5):

source: Go back to your user page
ca: Torna a la teva pàgina d'usuari
es: Volver a tu página de usuario

source: Go back to the main page
ca: Torna a la pàgina principal
es: Volver a la página principal
